app/views/comments/_review.html.erb

<% @comments.each do |comment| %>
<% @user = User.find_by_id(comment.user_id)%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1