app/views/courses/_course.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
---
    <span class="meta-author">
     <a href="#" title="#" rel="author"><%= link_to User.find_by_id(course.user_id).name,  User.find_by_id(course.user_id) %></a>

SELECT "topics".* FROM "topics" INNER JOIN "relationships" ON "topics"."id" = "relationships"."topic_id" WHERE "relationships"."course_id" = 10
---
   <span class="meta-categories">
    <% course.topics.each do |topic| %>