app/views/courses/course_payment.html.erb

SELECT "courses".* FROM "courses" ORDER BY courses.created_at DESC LIMIT 1
---

      Rs. <%=  @course.course_price_inbetween_date.first.price %>