app/views/courses/edit.html.erb

SELECT "topics".* FROM "topics" ORDER BY name
---
										<tr><td><%= f.label :topic_id, "Topics" %></td>
											<td><%= f.collection_select :topic_id, Topic.order(:name), :id, :name, {}, {multiple: false} %></td></tr>