app/views/courses/index.html.erb

                    <li><a href="#">Date</a></li>
                    <li><%= link_to "Upcoming" + " ( #{Course.where(ispublished: 0).all.size} )", courses_path %></li>
---
SELECT "courses".* FROM "courses" WHERE "courses"."ispublished" = 1 ORDER BY courses.created_at DESC

                   <% @topics.each do |topic| %>
                          <% @topicStructure = topic.name + " ( #{ topic.courses.where(ispublished: 1).size} )" %>
---
SELECT COUNT(*) FROM "courses" INNER JOIN "relationships" ON "courses"."id" = "relationships"."course_id" WHERE "relationships"."topic_id" = 4 AND "courses"."ispublished" = 1

              <% @courses.each do |course|%>
               <% course.topics.each do |topic| %>
---
SELECT "topics".* FROM "topics" ORDER BY name