app/views/courses/new.html.erb

SELECT "topics".* FROM "topics" ORDER BY name
---
										<td>
											<% topics_array = Topic.all.map { |topic| [topic.name, topic.id] } %>