app/controllers/comments_controller.rb

	def create
		@comment = @commentable.comments.build(params[:comment])
		@comment.user_id = current_user.id
		@course = Course.find(params[:commentable_id])
		@commentable_type = params[:commentable_type]
		@commentable_id = params[:commentable_id]
		#@course = Course.find(params[:commentable])
		respond_to do |format|
			if @comment.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "10"]]
INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

	def load_commentable
		@commentable = params[:commentable_type].camelize.constantize.find(params[:commentable_id])
		@comments = @commentable.comments.recent.limit(10).all
---
SELECT "comments".* FROM "comments" WHERE "comments"."commentable_id" = 10 AND "comments"."commentable_type" = 'Course' ORDER BY created_at DESC LIMIT 10