app/controllers/courses_controller.rb

def index
	@total_course_count = Course.where(ispublished: 1).all.count
	@countCoursesPerPage = 6
	if params[:mycourses]=="mycourses"
		@courses = Course.where(user_id: current_user.id).paginate(page: params[:page], per_page: 6)
	else
		@courses = Course.where(ispublished: 1).paginate(page: params[:page], :per_page => 6)
	end
	@topics = Topic.all
---
SELECT COUNT(*) FROM "courses" WHERE "courses"."ispublished" = 1
SELECT "courses".* FROM "courses" WHERE "courses"."ispublished" = 1 ORDER BY courses.created_at DESC LIMIT 5 OFFSET 0
SELECT "topics".* FROM "topics" ORDER BY name

def new
	@course = Course.new
	@topic = Topic.all
---
SELECT "topics".* FROM "topics" ORDER BY name

def edit
	@course= Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "7"]]

def show
	@course = Course.find(params[:id])
	@authors=[]
	@course.teaching_staffs.each do |teaching_staff|
		@authors << User.where(id: teaching_staff.user_id).first
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "10"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1

	def show
		@course = Course.find(params[:id])
		@authors=[]
  	    @course.teaching_staffs.each do |teaching_staff|
  		  @authors << User.where(id: teaching_staff.user_id).first
  	    end


	@modules=lms_get_modules(@course)
		#@countCommentsPerPage = 6
		@comments = @course.comments.paginate(page: params[:page], per_page: 6)
		#@count = @course.comments.count
		if signed_in?
			unless RatingCache.find_by_cacheable_id(@course.id) == nil
				@qty = RatingCache.find_by_cacheable_id(@course.id).qty
			end

			@rated = Rate.find_by_rater_id(current_user.id)
---
SELECT "rates".* FROM "rates" WHERE "rates"."rater_id" = 13 LIMIT 1

	def destroy
		@course = Course.find(params[:id])
		lms_id=@course.lms_id
		@course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "4"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 4]]