app/controllers/registrations_controller.rb

  def create

    @user=User.new(params[:user])

    # build_resource
    @account=Account.find_by_name(request.subdomain)



    if @user.save
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "image", "last_sign_in_at", "last_sign_in_ip", "lms_id", "name", "phone", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "sub_plan", "updated_at", "user_desc", "user_type", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)