app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all.paginate(page: params[:page], :per_page => 10)
---
SELECT "users".* FROM "users"

  def destroy
    authorize! :destroy, @user, :message => 'Not authorized as an administrator.'
    users = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1